artifacts/packs/openfoam-ecm-standalone_lumped_external_compat_blackbox_debug_20260330_131950/cases/lumped_solid/0/jellyRoll/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/jellyRoll";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
27144
(
-0.017388389
-0.0075189963
0.0025265229
0.012521584
0.021959615
-0.047414175
-0.038190875
-0.02777435
...
)
;

boundaryField
{
    jellyRoll_to_cap
    {
        type            calculated;
        value           nonuniform List<scalar> 
1528
(
-0.017295905
-0.0074631094
0.0025044047
0.012414426
0.021977789
-0.047297838
-0.038076103
-0.027650763
...
)
;
    }
    jellyRoll_to_shell
    {
        type            calculated;
        value           nonuniform List<scalar> 
9976
(
-0.036678483
-0.024670303
-0.028227799
-0.017421318
-0.017333068
-0.0075419338
-0.0075443047
0.0025345153
...
)
;
    }
}


// ************************************************************************* //
