artifacts/packs/openfoam-ecm-standalone_lumped_external_compat_blackbox_debug_20260330_131950/cases/lumped_solid/system/jellyRoll/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/jellyRoll";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ecmHeatSource
{
    type            scalarCodedSource;
    active          yes;
    name            ecmHeatSource;

    scalarCodedSourceCoeffs
    {
        selectionMode   cellZone;
        cellZone        jellyRoll;
        fields          (h);

        codeInclude
        #{
            #include "fvCFD.H"
        #};

        codeAddSup
        #{
            // Add volumetric heat source from ecmQdot [W/m^3] to enthalpy equation
            if (!mesh().foundObject<volScalarField>("ecmQdot"))
            {
                return;
            }

            const volScalarField& ecmQdot = mesh().lookupObject<volScalarField>("ecmQdot");

            forAll(cells_, i)
            {
                const label cellI = cells_[i];
                eqn.source()[cellI] -= ecmQdot[cellI]*mesh().V()[cellI];
            }
        #};

        codeAddSupRho
        #{
            if (!mesh().foundObject<volScalarField>("ecmQdot"))
            {
                return;
            }

            const volScalarField& ecmQdot = mesh().lookupObject<volScalarField>("ecmQdot");

            forAll(cells_, i)
            {
                const label cellI = cells_[i];
                eqn.source()[cellI] -= ecmQdot[cellI]*mesh().V()[cellI];
            }
        #};

        codeCorrect
        #{
        #};

        codeConstrain
        #{
        #};
    }
}

// ************************************************************************* //
